10/data/attachments/10b30033875190c4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_f88cbd7e-7760-4471-ab6e-83dbb5fb2da5</nif:username>
            <nif:friendToBeAdded>Michael_kid_Friend_29336_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>